#include <iostream>
using namespace std;

int main()
{
    setlocale(0, "");
    cout << "Задание 1\n";
    cout << "\nМихаил Лермонтов\n";
    cout << "Стихотворение: \"Утёс\"\n";
    cout << "\nНочевала тучка золотая\nНа груди утеса-великана;\nУтром в путь она умчалась рано,\n";
    cout << "По лазури весело играя;\n\nНо остался влажный след в морщине\nСтарого утеса. Одиноко\nОн стоит, задумался глубоко,\n";
    cout << "И тихонько плачет он в пустыне.\n";


    cout << "\nЗадание 2\n";
    cout << "\nКаждый\n";
    cout << "\tОхотник\n";
    cout << "\t\tЖелает\n";
    cout << "\t\t\tЗнать\n";
    cout << "\t\t\t\tГде\n";
    cout << "\t\t\t\t\tСидит\n";
    cout << "\t\t\t\t\t\tФазан\n";


    cout << "\n\tЗадание 3\n";
    cout << "\t=====================================\n";
    cout << "\t|\tПродам гараж\t\t\t\b\b\b\b|\n\t|\tСрочно\t\t\t\t\b\b\b\b|\n\t|\tТорг уместен\t\t\t\b\b\b\b|\n\t|\t\t\t\t\t\b\b\b\b|\n";
    cout << "\t|Звонить по телефону:8(800)555-35-35|\n";
    cout << "\t| 8 |\t| 8 |\t| 8 |\t| 8 |\t| 8 |\n\t| 8 |\t| 8 |\t| 8 |\t| 8 |\t| 8 |\n\t| 0 |\t| 0 |\t| 0 |\t| 0 |\t| 0 |\n";
    cout << "\t| 0 |\t| 0 |\t| 0 |\t| 0 |\t| 0 |\n";
    cout << "\t| 5 |\t| 5 |\t| 5 |\t| 5 |\t| 5 |\n\t| 5 |\t| 5 |\t| 5 |\t| 5 |\t| 5 |\n\t| 5 |\t| 5 |\t| 5 |\t| 5 |\t| 5 |\n";
    cout << "\t| 3 |\t| 3 |\t| 3 |\t| 3 |\t| 3 |\n\t| 5 |\t| 5 |\t| 5 |\t| 5 |\t| 5 |\n";
    cout << "\t| 3 |\t| 3 |\t| 3 |\t| 3 |\t| 3 |\n\t| 5 |\t| 5 |\t| 5 |\t| 5 |\t| 5 |\n";
    cout << "\t=====\t=====\t=====\t=====\t=====";
    return 0;
}
